update-items

In [2]:
import pandas as pd

In [3]:
data = {
    'city' : ['Toronto', 'Montreal', 'Waterloo'],
    'points' : [80, 70, 90]
}

In [4]:
data

{'city': ['Toronto', 'Montreal', 'Waterloo'], 'points': [80, 70, 90]}

In [5]:
df = pd.DataFrame(data)

In [6]:
df

       city  points
0   Toronto      80
1  Montreal      70
2  Waterloo      90

In [9]:
df.loc[df['city'] == 'Montreal', 'points'] = 75

In [10]:
df

       city  points
0   Toronto      80
1  Montreal      75
2  Waterloo      90